#--coding:utf-8--

import pandas as pd
from pandas import DataFrame
import numpy as np
import os
import xlrd

print("欢迎使用合并表格模板\n一切解释权均归开发者所有!\n开发者: 凡凡\n")

#参数指定
desk = os.path.join(os.path.expanduser("~"),"Desktop")
path = desk + "\\工资明细"
path_mid = 'D:\\根目录\\项目\\中间表格'
print(path)
sheet_dir = {"考勤":"kq","津贴":"jt","社保":"ss",
			 "附加-税务":"sw","附加-SAP":"sap",
			 "薪资异动表":"xz","津贴异动表":"jt1",
			 "小时工":"sl","银行明细":"bk"}

col_kq = ["SAP编号","姓名","当月计薪天数","应出勤天数","实际出勤天数",
			"全勤奖","饭贴","大店津贴","病假天数","无薪事假天数","产假天数",
			"婚假天数","丧假天数","空勤天数","旷工天数","出差天数","陪产假天数",
			"工伤假天数","调休小时","年休天数","有薪事假天数","店铺未打卡（次）",
			"非店铺未打卡（次）","非店铺迟到0-30M","非店铺迟到31-60M",
			"非店铺迟到61-120M","非店铺迟到120M以上","行政早退30M以内",
			"行政早退30M以上","店铺迟到0-10M","店铺迟到11-30M",
			"店铺迟到31-60M","店铺迟到61-120M","店铺迟到120M以上",
			"店铺早退1小时内","店铺早退1小时以上",
			"平时加班时","节日加班时","周末加班时"]
col_jt = ["SAP编号","姓名","工资项","金额
